help_ru = ("Помощь, которую мы заслужили👇\n\n"
           "🚀🛑 /on, /off - вкл/выкл ленту, состоящую из публикаций каналов на которые ты подписал/ся-ась через меня.\n"
           "💭(Приходит на твой личный канал, который мы добавили в самом начале нашего пути.)\n\n"
           "✅ /add - добавляет новые каналы в подписки.\n"
           "💭(Можно быстро накидать ссылки каналов, с помощью пересылки в телеграм, не общаясь со мной лицом к лицу.\n"
           "Главное в конце не забудь отправить мне команду /everything.)\n\n"
           "✅ /delete - удаляет каналы из подписок.\n"
           "💭(После начала процесса можешь для быстрого удаления использовать /subscriptions, где уже будут"
           " команды для удаления каждой подписки.\n"
           "Главное в конце не забудь отправить мне команду /everything.)\n\n"
           "✅ /change_my_channel - заменяет канал на который будут приходить публикации от подписок.\n\n"
           "📋 /subscriptions - показывает список подписок.\n\n"
           "💬 /wish - добавляет пожелание в будущие обновления.")

start_ru = (("Тута👀",
             "Ну смотри, для ленты нужно создать свой ПУБЛИЧНЫЙ канал!",
             "Потом добавь меня как администратора😎",
             "Учти, что правильность пунктов выше очень важна для нашей дружбы!",
             "Какая ссылка на твой личный канал, чтобы не запутаться?"
             ),
            ("Мы уже начинали когда-то.",
             "Когда были моложе😅",
             "Не забудь перезапустить ленту!"
             "Воспользуйся /help"
             ))

new_tape_ru = (("Хмм...",
                "Что-то не похоже на канал🤔"
                ),
               ("Тах тах я не администратор этого канала❓",
                "Жду cсылку на канал...",
                "Учти, я проверю😈"
                ),
               ("Запомнил✅",
                "Не забудь перезапустить ленту😊"
                ),
               ("Далее перечисли ПУБЛИЧНЫЕ каналы из которых мы сформируем твою ЛИЧНУЮ ленту!",
                "Через запятую конечно же.",
                "Можешь скинуть пока хотя бы одну, чтобы не тратить время...",
                "После того как познакомимся, сможешь быстро накидать мне остальные😜",
                "Учти, что некоторые каналы могут запрещать пересылку сообщений.",
                "С такими мы не дружим⚠️"
                ))

init_listen_ru = (("⚠️️️️️Что-то, но не каналы:\n",
                   ),
                  ("👍Существующие каналы:\n",
                   ),
                  ("Внеси исправления и снова скинь все мне!",
                   "Не забудь про запятую😈"
                   ),
                  ("Все запомнил👌",
                   "Воспользуйся /help"
                   ))

bot_messages_ru = {'help': help_ru, 'start': start_ru, 'new_tape': new_tape_ru, 'init_listen': init_listen_ru}
