help_ru = (
    "Помощь, которую мы заслужили👇\n\n"
    "🚀🛑 /on, /off - вкл/выкл ленту, состоящую из публикаций каналов на которые ты подписал/ся-ась через меня.\n"
    "💭(Приходит на твой личный канал, который мы добавили в самом начале нашего пути.)\n\n"
    "✅ /add - добавляет новые каналы в подписки.\n"
    "💭(Можно быстро накидать ссылки каналов, с помощью пересылки в телеграм, не общаясь со мной лицом к лицу.\n"
    "Главное в конце не забудь отправить мне команду /everything.)\n\n"
    "✅ /delete - удаляет каналы из подписок.\n"
    "💭(После начала процесса можешь для быстрого удаления использовать /subscriptions, где уже будут"
    " команды для удаления каждой подписки.\n"
    "Главное в конце не забудь отправить мне команду /everything.)\n\n"
    "✅ /change_my_channel - заменяет канал на который будут приходить публикации от подписок.\n\n"
    "📋 /subscriptions - показывает список подписок.\n\n"
    "💬 /wish - добавляет пожелание в будущие обновления."
)

everything_ru = (
    "Принял🤝",
    "Воспользуйся /help"
)

state_if_exist_ru = (
    "Все и сразу не получится♻️",
    "Сначала закончи предыдущие действия!"
)

channel_not_exist_ru = (
    "больше не существует, "
    "поэтому он будет удален из ваших подписок⚠️")

channel_on_protection = (
    " включил защиту на пересылку сообщений, "
    "поэтому он будет удален из ваших подписок⚠️"
)

tape_not_exist_ru = (
    "А что с каналом, "
    "в который я скидываю публикации твоих подписок?😧",
    "Попробуй снова добавить свой канал\n/change_my_channel😏"
)

admin_help_ru = (
    "➕➕➕Быстрые команды для создателя:\n"
    "/admin_post - опубликовать пост для всех пользователей.\n"
    "/admin_statistics - посмотреть общую статистику.\n"
)

start_ru = ((
                "Тута👀",
                "Ну смотри, для ленты нужно создать свой ПУБЛИЧНЫЙ канал!",
                "Потом добавь меня как администратора😎",
                "Учти, что правильность пунктов выше очень важна для нашей дружбы!",
                "Какая ссылка на твой личный канал, чтобы не запутаться?"
            ),
            (
                "Мы уже начинали когда-то.",
                "Когда были моложе😅",
                "Не забудь перезапустить ленту!"
                "Воспользуйся /help"
            ))

enter_new_tape_ru = ((
                         "Хмм...",
                         "Что-то не похоже на канал🤔"
                     ),
                     (
                         "Тах тах я не администратор этого канала❓",
                         "Жду cсылку на канал...",
                         "Учти, я проверю😈"
                     ),
                     (
                         "Запомнил✅",
                         "Не забудь перезапустить ленту😊"
                     ),
                     (
                         "Далее перечисли ПУБЛИЧНЫЕ каналы из которых мы сформируем твою ЛИЧНУЮ ленту!",
                         "Через запятую конечно же.",
                         "Можешь скинуть пока хотя бы одну, чтобы не тратить время...",
                         "После того как познакомимся, сможешь быстро накидать мне остальные😜",
                         "Учти, что некоторые каналы могут запрещать пересылку сообщений.",
                         "С такими мы не дружим⚠️"
                     ))

enter_init_listen_ru = ((
                            "⚠️️️️️Что-то, но не каналы:\n",
                        ),
                        (
                            "👍Существующие каналы:\n",
                        ),
                        (
                            "Внеси исправления и снова скинь все мне!",
                            "Не забудь про запятую😈"
                        ),
                        (
                            "Все запомнил👌",
                            "Воспользуйся /help"
                        ))

start_tape_ru = ((
                     "Как бы лента уже запущена😅",
                 ),
                 (
                     "Тах тах, добавь сначала канал, "
                     "куда я буду скидывать публикации "
                     "твоих подписок /change_my_channel!",
                 ),
                 (
                     "Все хорошо, только добавь сначала хотя бы один канал в подписки...",
                     "Воспользуйся /add"
                 ),
                 (
                     "Лента запущена🚀",
                 ))

stop_tape_ru = ((
                    "Лента остановлена🛑",
                ),
                (
                    "Как остановить то, что даже не запустили🥲",
                ))

add_listen_ru = (
    "Слушаю👂",
    "Накидывай каналы, которые хочешь добавить.",
    "Как закончишь скажи просто \n /everything"
)

enter_add_listen_ru = ((
                           "Что-то не похоже на канал🤔",
                           "Исправь и снова скинь мне..."
                       ),
                       (
                           "Канал уже есть в твоих подписках...",
                           "Давай другой😁"
                       ),
                       (
                           "Добавил✅",
                       ))

delete_listen_ru = ((
                        "Внимаю:👏",
                        "Накидывай каналы, которые хочешь удалить.",
                        "Как закончишь скажи просто \n /everything"
                    ),
                    (
                        "Что мы решили удалить из подписок, если даже нет ни одной....",
                        "Сначала добавь хоть одну /add"

                    ))

enter_delete_listen_ru = ((
                              "Что-то не похоже на канал🤔",
                              "Исправь и снова скинь мне..."
                          ),
                          (
                              "Такого канала нет в твоих подписках😅",
                          ),
                          (
                              "Удалил✅",
                          ))

change_tape_ru = (
    "Ну что, пора переезжать на новый канал для ленты🍻",
    "Напомню, для ленты нужно создать свой ПУБЛИЧНЫЙ канал и добавить меня как администратора😎",
    "Какая ссылка на твой личный канал, чтобы не запутаться?"
)

subscriptions_ru = ((
                        "Твои подписки📋:",
                    ),
                    (
                        "Твои подписки📋:\n"
                        "Пусто"
                    ),
                    (
                        "Cначала добавь хотя бы одну подписку😁",
                        "Воспользуйся /add"
                    ))

wish_ru = ((
               "Твое пожелание👇\n\n",
               '⬇⬇⬇\n\n',
               '\n\n⬆⬆⬆'
           ),
           (
               "Хочешь исправить?(Да/Нет)",
           ),
           (
               "Что желаешь увидеть в будущих обновлениях?💬",
               "Учти, что я смогу учесть только одно сообщение, так что напиши развернуто🎞️"
           ))

switch_wish_ru = ((
                      "Понял, внимаю😏",

                  ),
                  (
                      "Понял, побежали дальше по делам😎",
                  ),
                  (
                      "Ну ладно, cчитаю, что нет😈",
                  ))

enter_wish_ru = (
    "Принял👌",
    "В дальнейшем,если что сможешь переправить😉"
)

echo_ru = (
    "Тах тах не флуди...👊",
    "Воспользуйся /help"
)

engineering_works_ru = (
    "Don't worry, проводятся технические работы👨‍💻",
    "А все, технические работы закончились🔥"
)

bot_messages_ru = {
    'help': help_ru,
    'everything': everything_ru,
    'state_if_exist': state_if_exist_ru,
    'channel_not_exist': channel_not_exist_ru,
    'channel_on_protection': channel_on_protection,
    'tape_not_exist': tape_not_exist_ru,
    'admin_help': admin_help_ru,
    'start': start_ru,
    'enter_new_tape': enter_new_tape_ru,
    'enter_init_listen': enter_init_listen_ru,
    'start_tape': start_tape_ru,
    'stop_tape': stop_tape_ru,
    'add_listen': add_listen_ru,
    'enter_add_listen': enter_add_listen_ru,
    'delete_listen': delete_listen_ru,
    'enter_delete_listen': enter_delete_listen_ru,
    'change_tape': change_tape_ru,
    'subscriptions': subscriptions_ru,
    'wish': wish_ru,
    'switch_wish': switch_wish_ru,
    'enter_wish': enter_wish_ru,
    'echo': echo_ru,
    'engineering_works': engineering_works_ru
}
