help_ru = (
    "Помощь, которую мы заслужили👇\n\n"
    "🚀🛑 /on, /off - вкл/выкл ленту, состоящую из публикаций каналов, на которые ты подписался через меня.\n"
    "💭(Приходит на твой личный канал, который мы добавили в начале нашего пути.)\n\n"
    "✅ /add - добавляет новые каналы в твои подписки.\n"
    "💭(Можно быстро скинуть мне ссылки на каналы с помощью пересылки в Telegram, не общаясь со мной лично.\n"
    "Главное - в конце не забудь отправить мне команду /end.)\n\n"
    "✅ /delete - удаляет каналы из твоих подписок.\n"
    "💭(После начала процесса можешь для быстрого удаления использовать команду /subscriptions, где уже будут временные"
    " команды на удаление каждой подписки.\n"
    "Главное - в конце не забудь отправить мне команду /end.)\n\n"
    "✅ /change_feed_channel - заменяет канал, на который будут приходить публикации от твоих подписок.\n\n"
    "📋 /subscriptions - показывает твои подписки.\n\n"
    "💬 /wish - добавить пожелания для будущих обновлений."
)

end_ru = (
    "Принял🤝",
    "Воспользуйся /help"
)

state_if_exist_ru = (
    "Все и сразу не бывает ♻️",
    "Сначала закончи предыдущие действия!"
)

channel_not_exist_ru = (
    " больше не существует, "
    "поэтому он будет удален из ваших подписок⚠️")

channel_on_protection = (
    " включил защиту на пересылку сообщений, "
    "поэтому он будет удален из ваших подписок⚠️"
)

tape_not_exist_ru = (
    "А что с каналом, куда скидываются публикации твоих подписок? 😧",
    "Попробуй снова добавить канал\n/change_feed_channel😏"
)

start_ru = ((
                "Тута👀",
                "Ну, смотри, чтобы сделать ленту, сначала создай свой ПУБЛИЧНЫЙ канал!",
                "Потом добавь меня как администратора😎",
                "Учти, что твое правильное выполнение предыдущих шагов очень важно для нашей дальнейшей дружбы!",
                "Какая ссылка на твой личный канал?"
            ),
            (
                "Мы уже начинали когда-то.",
                "Когда были моложе😅",
                "Не забудь перезапустить ленту!"
                "Воспользуйся /help"
            ))

enter_new_tape_ru = ((
                         "Хмм...",
                         "Что-то не похоже на ПУБЛИЧНЫЙ канал🤔"
                     ),
                     (
                         "Так, так, так, кажется, я не администратор этого канала❓",
                         "Жду cсылку на твой канал...",
                         "Учти, я проверю😈"
                     ),
                     (
                         "Запомнил✅",
                         "Не забудь перезапустить ленту😁"
                     ),
                     (
                         "Далее, перечисли ПУБЛИЧНЫЕ каналы, из которых мы сформируем твою ЛИЧНУЮ ленту!",
                         "Через запятую, конечно же.",
                         "Можешь скинуть пока хотя бы одну, чтобы не тратить время...",
                         "После того, как мы познакомимся, ты сможешь быстро скинуть мне остальные каналы😜",
                         "Учти, что некоторые каналы могут запрещать пересылку сообщений.",
                         "С такими мы не дружим⚠️"
                     ))

enter_init_listen_ru = ((
                            "⚠️️️️️Что-то, но не ПУБЛИЧНЫЕ каналы:\n",
                        ),
                        (
                            "👍Существующие каналы:\n",
                        ),
                        (
                            "Внеси исправления и снова скинь мне!",
                            "Не забудь про запятую😈"
                        ),
                        (
                            "Все запомнил👌",
                            "Лента запущена🚀",
                            "Воспользуйся /help"
                        ))

start_tape_ru = ((
                     "Лента уже запущена😅",
                 ),
                 (
                     "Так, так, так, добавь сначала канал, "
                     "куда я буду скидывать публикации "
                     "твоих подписок /change_my_channel!",
                 ),
                 (
                     "Все хорошо, только добавь хотя бы один канал в подписки...",
                     "Воспользуйся /add"
                 ),
                 (
                     "Лента запущена🚀",
                 ))

stop_tape_ru = ((
                    "Лента остановлена🛑",
                ),
                (
                    "Как остановить то, что даже не было запущено😅",
                ))

add_listen_ru = (
    "Слушаю👂",
    "Скидывай каналы, которые хочешь добавить.",
    "Когда надоест, скажи просто \n /end"
)

enter_add_listen_ru = ((
                           "Что-то не похоже на ПУБЛИЧНЫЙ канал🤔",
                           "Исправь и снова скинь мне..."
                       ),
                       (
                           "Канал уже есть в твоих подписках...",
                           "Давай другой😁"
                       ),
                       (
                           "Добавил✅",
                       ))

delete_listen_ru = ((
                        "Внимаю:👏",
                        "Скидывай каналы, которые хочешь удалить.",
                        "Для быстрого удаления воспользуйся /subscriptions",
                        "Как закончишь, скажи просто \n /end"
                    ),
                    (
                        "Что мы решили удалить из подписок, если даже нет ни одной....",
                        "Воспользуйся /add"
                    ))

enter_delete_listen_ru = ((
                              "Пора закругляться, так как у тебя нет больше подписок...",
                              "Cкажи /end"
                          ),
                          (
                              "Что-то не похоже на ПУБЛИЧНЫЙ канал🤔",
                              "Исправь и снова скинь мне..."
                          ),
                          (
                              "Такого канала нет в твоих подписках😅",
                          ),
                          (
                              "Удалил✅",
                          ))

change_tape_ru = (
    "Ну что, пора переезжать на новый канал для ленты🍻",
    "Напомню, для ленты нужно создать свой ПУБЛИЧНЫЙ канал и добавить меня как администратора😎",
    "Какая ссылка на твой личный канал, чтобы не запутаться?"
)

subscriptions_ru = ((
                        "Твои подписки📋:\n",
                    ),
                    (
                        "Твои подписки📋:\n\n"
                        "⚠️Пусто"
                    ))

wish_ru = ((
               "Твое желание💬\n\n",
               '🔥🔥🔥\n\n',
               '\n\n🔥🔥🔥'
           ),
           (
               "Хочешь исправить?",
           ),
           (
               "Что желаешь увидеть в будущих обновлениях?💬",
               "Учти, что я смогу учесть только одно сообщение, так что напиши развернуто🎞️"
           ))

switch_wish_ru = ((
                      "Понял, внимаю😏",

                  ),
                  (
                      "Понял, побежали дальше по делам😎",
                  ),
                  (
                      "Ну ладно, cчитаю, что нет😈",
                  ))

enter_wish_ru = (
    "Принял👌",
    "В дальнейшем,если что, сможешь переправить😉"
)

echo_ru = (
    "Так, так, так, не флуди...👊",
    "Воспользуйся /help"
)

engineering_works_ru = (
    "Don't worry, проводятся технические работы👨‍💻",
    "А все, технические работы закончились🔥"
)

bot_messages_ru = {
    'help': help_ru,
    'end': end_ru,
    'state_if_exist': state_if_exist_ru,
    'channel_not_exist': channel_not_exist_ru,
    'channel_on_protection': channel_on_protection,
    'tape_not_exist': tape_not_exist_ru,
    'start': start_ru,
    'enter_new_tape': enter_new_tape_ru,
    'enter_init_listen': enter_init_listen_ru,
    'start_tape': start_tape_ru,
    'stop_tape': stop_tape_ru,
    'add_listen': add_listen_ru,
    'enter_add_listen': enter_add_listen_ru,
    'delete_listen': delete_listen_ru,
    'enter_delete_listen': enter_delete_listen_ru,
    'change_tape': change_tape_ru,
    'subscriptions': subscriptions_ru,
    'wish': wish_ru,
    'switch_wish': switch_wish_ru,
    'enter_wish': enter_wish_ru,
    'echo': echo_ru,
    'engineering_works': engineering_works_ru
}
