help_ru = (
    "Помощь, которую мы заслужили👇\n\n"
    "⌨️ /menu - меню для быстрого вызова основных команд.\n\n"
    "🚀🛑 /on, /off - вкл/выкл ленту, состоящую из публикаций каналов, на которые ты подписался через меня.\n\n"
    "➕ /add - добавляет по очереди новые каналы в твои подписки.\n"
    "💭(Можно быстро скинуть мне ссылки на каналы с помощью пересылки в Telegram, не общаясь со мной лично.\n"
    "Главное - в конце не забудь отправить мне команду /end.)\n\n"
    "➖ /delete - удаляет по очереди каналы из твоих подписок.\n"
    "💭(После начала процесса можешь, для быстрого удаления, использовать команду /subscriptions, где уже будут временные"
    " команды на удаление каждой подписки.\n"
    "Главное - в конце не забудь отправить мне команду /end.)\n\n"
    "📋 /subscriptions - показывает твои подписки.\n\n"
    "💬 /wish - добавить пожелания для будущих обновлений."
)

menu_ru = (
    "Лови👾"
)

end_ru = (
    "Принял🤝",
    "Воспользуйся /menu"
)

state_if_exist_ru = (
    "Все и сразу не бывает ♻️",
    "Сначала закончи предыдущие действия!"
)

channel_not_exist_ru = (
    " больше не существует, "
    "поэтому он будет удален из ваших подписок⚠️")

channel_on_protection = (
    " включил защиту на пересылку сообщений, "
    "поэтому он будет удален из ваших подписок⚠️"
)

start_ru = ((
                "Тута👀",
                "❗ Для начала пришли мне хотя бы одну публичную ссылку на канал.",
                "💭(Ссылку на канал можешь найти на главной странице канала,"
                " если ее нет, то он приватный, c такими мы не дружим⚠️️️️️)",
                "После того, как мы познакомимся, ты сможешь быстро прислать мне все остальные каналы😜",
                "💭(Напомню, после добавления каналов в твои подписки, можешь спокойно удалить эти каналы у себя в диалогах😎)",
            ),
            (
                "Мы уже начинали когда-то.",
                "Когда были моложе🤭"
            ))

enter_init_listen_ru = ((
                            "⚠️️️️️Что-то, но не публичные ссылки каналов:\n",
                        ),
                        (
                            "👍Существующие каналы:\n",
                        ),
                        (
                            "Внеси исправления и снова скинь мне публичные cсылку на канал😈",
                        ),
                        (
                            "Все запомнил👌",
                            "Лента запущена🚀",
                            "Воспользуйся /help"
                        ))

start_tape_ru = ((
                     "Лента уже запущена😁",
                 ),
                 (
                     "Все хорошо, только добавь хотя бы один канал в свои подписки🤔",
                     "Воспользуйся /add"
                 ),
                 (
                     "Лента запущена🚀",
                 ))

stop_tape_ru = ((
                    "Лента остановлена🛑",
                ),
                (
                    "Как остановить то, что даже не было запущено😅",
                ))

add_listen_ru = (
    "Слушаю👂",
    "Скидывай по очереди публичные ссылки на каналы, которые хочешь добавить в свои подписки.",
    "💭(Ссылку на канал можешь найти на главной странице канала,"
    " если ее нет, то он приватный, c такими мы не дружим⚠️️️️️)",
    f"Когда надоест, скажи просто \n /end"
)

enter_add_listen_ru = ((
                           "Что-то не похоже на публичную ссылку канала🤔",
                           "Исправь и снова скинь мне..."
                       ),
                       (
                           "Канал уже есть в твоих подписках...",
                           "Давай другой😁"
                       ),
                       (
                           "Добавил✅",
                       ))

delete_listen_ru = ((
                        "Внимаю:👏",
                        "Скидывай по очереди публичные ссылки на каналы,"
                        " которые хочешь удалить из своих подписок.",
                        "❗ Для быстрого удаления воспользуйся \n/subscriptions",
                        "Как закончишь, скажи просто \n/end"
                    ),
                    (
                        "Что мы решили удалить из подписок, если даже нет ни одной🤔",
                        "Воспользуйся /add"
                    ))

enter_delete_listen_ru = ((
                              "Пора закругляться, так как у тебя нет больше подписок🤔",
                              "Воспользуйся /add"
                          ),
                          (
                              "Удалил✅",
                          ),
                          (
                              "Такого канала нет в твоих подписках😅",
                          )
)

subscriptions_ru = ((
                        "Твои подписки📋:\n",
                    ),
                    (
                        "Твои подписки📋:\n\n"
                        "⚠️Пусто"
                    ))

wish_ru = ((
               "Твое желание🔥🔥🔥\n\n",
           ),
           (
               "Хочешь исправить?",
           ),
           (
               "Что желаешь увидеть в будущих обновлениях?💬",
               "Учти, что я смогу учесть только одно сообщение, так что напиши развернуто👆",
               "💭(Если твое предыдущее пожелание бесследно исчезло, то значит я его переслал своему создателю на рассмотрение.)",
           ))

switch_wish_ru = ((
                      "Понял, внимаю😏",

                  ),
                  (
                      "Понял, побежали дальше по делам😎",
                  ),
                  (
                      "Ну ладно, cчитаю, что нет😈",
                  ))

enter_wish_ru = (
    "Принял👌",
    "В дальнейшем, если что, сможешь переправить😉"
)

echo_ru = (
    "Так, так, так, не флуди...👊",
    "Воспользуйся /help"
)

engineering_works_ru = (
    "Don't worry, проводятся технические работы👨‍💻",
    "А все, технические работы закончились🔥"
)

bot_messages_ru = {
    'help': help_ru,
    'end': end_ru,
    'state_if_exist': state_if_exist_ru,
    'channel_not_exist': channel_not_exist_ru,
    'channel_on_protection': channel_on_protection,
    'start': start_ru,
    'enter_init_listen': enter_init_listen_ru,
    'start_tape': start_tape_ru,
    'stop_tape': stop_tape_ru,
    'add_listen': add_listen_ru,
    'enter_add_listen': enter_add_listen_ru,
    'delete_listen': delete_listen_ru,
    'enter_delete_listen': enter_delete_listen_ru,
    'subscriptions': subscriptions_ru,
    'wish': wish_ru,
    'switch_wish': switch_wish_ru,
    'enter_wish': enter_wish_ru,
    'echo': echo_ru,
    'engineering_works': engineering_works_ru,
    'menu': menu_ru
}
