help_ru = ("Помощь, которую мы заслужили👇\n\n"
           "🚀🛑 /on, /off - вкл/выкл ленту, состоящую из публикаций каналов на которые ты подписал/ся-ась через меня.\n"
           "💭(Приходит на твой личный канал, который мы добавили в самом начале нашего пути.)\n\n"
           "✅ /add - добавляет новые каналы в подписки.\n"
           "💭(Можно быстро накидать ссылки каналов, с помощью пересылки в телеграм, не общаясь со мной лицом к лицу.\n"
           "Главное в конце не забудь отправить мне команду /everything.)\n\n"
           "✅ /delete - удаляет каналы из подписок.\n"
           "💭(После начала процесса можешь для быстрого удаления использовать /subscriptions, где уже будут"
           " команды для удаления каждой подписки.\n"
           "Главное в конце не забудь отправить мне команду /everything.)\n\n"
           "✅ /change_my_channel - заменяет канал на который будут приходить публикации от подписок.\n\n"
           "📋 /subscriptions - показывает список подписок.\n\n"
           "💬 /wish - добавляет пожелание в будущие обновления.")

start_ru = (("Тута👀",
             "Ну смотри, для ленты нужно создать свой ПУБЛИЧНЫЙ канал!",
             "Потом добавь меня как администратора😎",
             "Учти, что правильность пунктов выше очень важна для нашей дружбы!",
             "Какая ссылка на твой личный канал, чтобы не запутаться?"
             ),
            ("Мы уже начинали когда-то.",
             "Когда были моложе😅",
             "Не забудь перезапустить ленту!"
             "Воспользуйся /help"
             ))

bot_messages_ru = {'help': help_ru, 'start': start_ru}
